Repository: pgadmin-org/pgadmin3
Catalog: src/ui/*/pgadmin3.po
Languages: fa_ir

source: Cancelled.
fa_ir: لغو شد

source: Retrieve all rows anyway?
fa_ir: آیا تمام ردیف‌ها در هر حال دریافت شوند؟

source: Done.
fa_ir: انجام شد

source: %.2f secs
fa_ir: %.2f ثانیه

source: %d rows retrieved.
fa_ir: %d ردیف دریافت شد

source: %d rows.
fa_ir: %d ردیف‌ها

source: %ld rows not retrieved.
fa_ir: %ld ردیف دریافت نشد.

source: %ld rows retrieved.
fa_ir: %ld ردیف دریافت شد.

source: &About...
fa_ir: &درباره...

source: &Add
fa_ir: &افزودن

source: &Add %s to query
fa_ir: &افزودن %s به پرسش

source: &Add Server...
fa_ir: &افزودن کارگزار...

source: &Add Table/View...
fa_ir: &افزودن جدول/نما...

source: &Bugreport
fa_ir: گزارش &اشکال

source: &Cancel
fa_ir: &لغو

source: &Cancel Alt-Break
fa_ir: &لغو Alt-Break

source: &Close
fa_ir: &بستن

source: &Close Table/View
fa_ir: &بستن جدول/نما

source: &Connect...
fa_ir: ا&رتباط...

source: &Copy Ctrl-C
fa_ir: &کپی Ctrl-C

source: &Create
fa_ir: ا&یجاد

source: &Debug (not recommended for normal use)
fa_ir: اش&کال‌زدایی (برای استفاده معمولی پیشنهاد نمیشود)

source: &Delete
fa_ir: &حذف

source: &Delete/Drop
fa_ir: &حذف/رها کردن

source: &Delete/Drop Del
fa_ir: &حذف/رها Del

source: &Deselect All
fa_ir: ن&گزیدن همه

source: &Disconnect
fa_ir: ق&طع ارتباط

source: &Display
fa_ir: نما&یش

source: &Edit
fa_ir: ویر&ایش

source: &Errors only
fa_ir: &فقط خطاها

source: &Execute
fa_ir: ا&جرا

source: &Execute F5
fa_ir: &اجرا F5

source: &Export
fa_ir: &صدور

source: &File
fa_ir: &پرونده

source: &Find Ctrl-F
fa_ir: &یافتن Ctrl-F

source: &Help
fa_ir: &راهنما

source: &Help...
fa_ir: &راهنما...

source: &Join To...
fa_ir: &پیوند دادن به...

source: &Maintenance
fa_ir: &نگهداری

source: &No logging
fa_ir: &بدون ثبت

source: &OK
fa_ir: &تایید

source: &Open...
fa_ir: با&ز کردن...

source: &Open... Ctrl-O
fa_ir: با&ز کردن... Ctrl-O

source: &Options...
fa_ir: &گزینه‌ها...

source: &Paste Ctrl-V
fa_ir: &چسباندن Ctrl-V

source: &PostgreSQL Help
fa_ir: &PostgreSQL راهنمای

source: &Properties
fa_ir: &مشخصات

source: &Query
fa_ir: &پرسش

source: &Query Analyzer
fa_ir: تحلیل کننده &پرسش

source: &Query Builder
fa_ir: سازنده &پرسش

source: &Query tool
fa_ir: ابزار پ&رسش

source: &Recent files
fa_ir: پرونده‌های ا&خیر

source: &Redo Ctrl-Y
fa_ir: &بازانجام Ctrl-Y

source: &SQL Help F1
fa_ir: راهنمای &SQL F1

source: &Save
fa_ir: &ذخیره

source: &Save Ctrl-S
fa_ir: &ذخیره Ctrl-S

source: &Save definition...
fa_ir: &ذخیره تعریف...

source: &Server Status
fa_ir: وضعیت &کارگزار

source: &System objects
fa_ir: اشیای &سیستم

source: &Tip of the day...
fa_ir: &نکته‌ی راهنمای روز

source: &Tools
fa_ir: &ابزارها

source: &Undo Ctrl-Z
fa_ir: بر&گشت Ctrl-Z

source: &View
fa_ir: &نما

source: (binary compatible)
fa_ir: (همخوانی دوگانی)

source: -- Executing query:
fa_ir: --اجرای پرسش:

source: -- definition incomplete
fa_ir: -- تعریف ناقص

source: -- nothing to change
fa_ir: -- چیزی برای تغییر وجود ندارد

source: 0 Secs
fa_ir: 0 ثانیه

source: : Notebook not found. Prepare to crash!
fa_ir: : رایانه همراه یافت نشد. /n برای خراب شدن برنامه آماده شوید!

source: <html><body>Loading %s</body></html>
fa_ir: <html><body>%s در حال بارگزاری </body></html>

source: <none>
fa_ir: <هیچکدام>

source: > operator
fa_ir: > عامل

source: A fatal error has occured:
fa_ir: یک خطای جدی رخ داده است:

source: Accept the current settings and close the dialogue.
fa_ir: پذیرش تنظیمات کنونی و بستن این گفتگو.

source: Access method
fa_ir: روش دستیابی

source: Account expires
fa_ir: زمان حساب پایان یافت

source: Action
fa_ir: فعالیت

source: Add
fa_ir: افزودن

source: Add Server
fa_ir: افزودن کارگزار

source: Add Tables/Views
fa_ir: افزودن جدول‌ها/نماها

source: Add a connection to a server.
fa_ir: افزودن یک ارتباط به یک کارگزار.

source: Add a new Check Constraint.
fa_ir: افزودن یک بررسی Constraint.

source: Add a new Column.
fa_ir: افزودن یک ستون جدید.

source: Add a new Foreign Key.
fa_ir: افزودن یک کلید خارجی جدید.

source: Add a new Index.
fa_ir: افزودن یک شاخص جدید.

source: Add a new Trigger.
fa_ir: افزودن یک Trigger جدید.

source: Add a new Unique Constraint.
fa_ir: افزودن یک Constraint جدید یگانه.

source: Add a table or view to the datagram.
fa_ir: افزودن یک جدول یا نما به این نمودار داده‌ها.

source: Add/Change
fa_ir: افزودن/تغییر

source: Alias
fa_ir: اسم مستعار

source: Alignment
fa_ir: همترازی

source: Allow connections?
fa_ir: اجازه ارتباطات؟

source: An error has occured:
fa_ir: یک خطا رخ داده است

source: Analyze
fa_ir: تحلیل

source: Are you sure you wish to drop %s %s?
fa_ir: آیا مطمئن هستید که می‌خواهید %s %s را رها کنید؟

source: Argument count
fa_ir: شمارش مبحث

source: Arguments
fa_ir: مبحث‌ها

source: Back
fa_ir: برگشت

source: Back to previous page.
fa_ir: برگشت به صفحه پیشین.

source: Base type
fa_ir: نوع پایه

source: Browse for a logfile.
fa_ir: مرور برای یک پرونده ثبت.

source: C&hange password...
fa_ir: تغ&ییر گذرواژه

source: C&lear window
fa_ir: &پاک کردن پنجره

source: Cache
fa_ir: حافظه‌ی پنهان

source: Can't add another column to the query.
fa_ir: نمی‌توان ستون دیگری به این پرسش افزود.

source: Cancel
fa_ir: لغو

source: Cancel any changes and close the dialogue.
fa_ir: لغو هر تغییرات و بستن این گفتگو

source: Cancel query
fa_ir: لغو پرسش

source: Cancelled
fa_ir: لغو شده

source: Cancelling.
fa_ir: در حال لغو کردن.

source: Cannot drop system %s %s.
fa_ir: نمی‌توان سیستم %s%s را رها نمود.

source: Cannot initialise the networking subsystem!
fa_ir: نمی‌توان زیرسیستم این شبکه را آشناسازی کرد!

source: Cannot open the logfile!
fa_ir: نمیتوان این پرونده ثبت را گشود!

source: Change
fa_ir: تغییر

source: Change Password
fa_ir: تغییر واژه رمز

source: Change your password.
fa_ir: گذرواژه‌ی خود را تغییر دهید.

source: Changing the 'Show System Objects' option will cause all connections to be closed, and the treeview to be rebuilt. Are you sure you wish to continue?
fa_ir: تغییر این گزینه‌ی نمایش اشیای سیستم باعث بسته شدن تمام ارتباطات خواهد شد، و این درخت‌نما دوباره‌سازی میشود. آیا مطمئن هستید که می‌خواهید ادامه دهید؟

source: Check
fa_ir: بررسی

source: Check for unbalanced single quote marks in the condition for row #%d.
fa_ir: نشانه‌های نقل قول در این شرط را برای یافتن عدم توازن برای ردیف #%d کنترل نمایید.

source: Child columns
fa_ir: ستونهای نوزاد

source: Choose the operator for comparison.
fa_ir: انتخاب عامل برای مقایسه.

source: Clear edit window
fa_ir: پاک کردن محتوای پنجره ویرایش

source: Clear history
fa_ir: پاک کردن سرگذشت

source: Clear history window.
fa_ir: پاک کردن پنجره سرگذشت.

source: Clear window
fa_ir: پاک کردن پنجره

source: Close
fa_ir: بستن

source: Close this Window.
fa_ir: بستن این پنجره.

source: Clustered?
fa_ir: دسته شده؟

source: Column
fa_ir: ستون

source: Column name
fa_ir: نام ستون

source: Column names
fa_ir: نامهای ستون

source: Column not found in pgSet:
fa_ir: عدم یافتن ستون در pgSet:

source: Column separator
fa_ir: جداساز ستون‌

source: Columns
fa_ir: ستون‌ها

source: Comment
fa_ir: توضیح

source: Condition
fa_ir: شرط

source: Confirm Password
fa_ir: تصدیق گذرواژه

source: Confirm object deletion?
fa_ir: حذف شیئ تصدیق شود؟

source: Connect to a Server
fa_ir: ارتباط با یک کارگزار

source: Connect to the selected server.
fa_ir: ارتباط با کارگزار انتخاب شده.

source: Connected?
fa_ir: مرتبط؟

source: Constraint name
fa_ir: نام Constraint

source: Context
fa_ir: زمینه

source: Continue?
fa_ir: ادامه؟

source: Conversion
fa_ir: تبدیل

source: Conversions
fa_ir: تبدیل‌ها

source: Copied
fa_ir: کپی شده

source: Copy
fa_ir: کپی

source: Copy SQL from main form to SQL dialogue
fa_ir: کپی SQL از شکل اصلی به گفتگوی SQL

source: Copy selected text to clipboard
fa_ir: کپی متن انتخاب شده به صفحه‌برش

source: Could not resolve hostname %s
fa_ir: نام میزبان %s یافت نشد

source: Couldn't create a connection dialogue!
fa_ir: نتوانستم یک گفتگوی ارتباط را ایجاد کنم!

source: Couldn't create a connection object!
fa_ir: نتوانستم یک شیئ ارتباط را ایجاد کنم!

source: Couldn't create a pgSet object!
fa_ir: نتوانستم یک شیئ pgSet را ایجاد کنم!

source: Couldn't create the main window!
fa_ir: نتوانستم پنجره اصلی را ایجاد کنم!

source: Couldn't create the splash screen!
fa_ir: نتوانستم پرده‌ی جلوه را ایجاد نمایم!

source: Couldn't open a tips.txt file!
fa_ir: نتوانستم یک پرونده tips.txt را باز کنم!

source: Count rows if estimated less than
fa_ir: شمارش ردیف‌ها اگر تخمین کمتر از

source: Create
fa_ir: ایجاد

source: Create a Primary Key.
fa_ir: ایجاد یک کلید مقدم.

source: Create a new Aggregate.
fa_ir: ایجاد یک Aggregate جدید.

source: Create a new Cast.
fa_ir: ایجاد یک Cast جدید.

source: Create a new Conversion.
fa_ir: ایجاد یک Conversion جدید.

source: Create a new Database.
fa_ir: ایجاد یک بانک اطلاعاتی جدید.

source: Create a new Domain.
fa_ir: ایجاد یک دامنه‌ی جدید.

source: Create a new Function.
fa_ir: ایجاد یک تابع جدید.

source: Create a new Group.
fa_ir: ایجاد یک گروه جدید.

source: Create a new Language.
fa_ir: ایجاد یک زبان جدید.

source: Create a new Operator Class.
fa_ir: ایجاد یک کلاس عامل جدید.

source: Create a new Operator.
fa_ir: ایجاد یک عامل جدید.

source: Create a new Rule.
fa_ir: ایجاد یک قاعده جدید.

source: Create a new Schema.
fa_ir: ایجاد یک طرح جدید.

source: Create a new Sequence.
fa_ir: ایحاد یک توالی جدید.

source: Create a new Server connection.
fa_ir: ایجاد یک ارتباط کارگزاری جدید.

source: Create a new Table.
fa_ir: ایجاد یک جدول جدید.

source: Create a new Trigger Function.
fa_ir: ایجاد یک تابع Trigger جدید.

source: Create a new Type.
fa_ir: ایجاد یک نوع داده‌ای جدید.

source: Create a new User.
fa_ir: ایجاد یک کاربر جدید.

source: Create a new View.
fa_ir: ایجاد یک نمای جدید.

source: Create a new object of the same type as the selected object.
fa_ir: ایجاد یک شیئ از همان نوع شیئ که انتخاب شده است.

source: Create a new object.
fa_ir: ایجاد یک شیئ جدید.

source: Create databases?
fa_ir: ایجاد بانکهای اطلاعاتی؟

source: Cu&t Ctrl-X
fa_ir: بر&ش Ctrl-X

source: Current Password
fa_ir: گذرواژه کنونی

source: Current value
fa_ir: مقدار کنونی

source: Cut
fa_ir: برش

source: Cut selected text to clipboard
fa_ir: بریدن متن انتخاب شده به صفحه‌برش

source: Cycled
fa_ir: دواری

source: Data
fa_ir: داده‌ها

source: Data Output
fa_ir: برونداد داده‌ها

source: Data retrieval runtime:
fa_ir: زمان‌اجرای دریافت داده‌ها:

source: Data type
fa_ir: نوع داده‌ها

source: Database
fa_ir: بانک اطلاعات

source: Database Status
fa_ir: وضعیت بانک اطلاعات

source: Databases
fa_ir: بانک‌های اطلاعات

source: Default
fa_ir: پیش‌فرض

source: Default value
fa_ir: ارزش پیش‌فرض

source: Default?
fa_ir: پیش‌فرض؟

source: Deferrable
fa_ir: قابل درنگ

source: Deferrable?
fa_ir: قابل درنگ؟

source: Deferred
fa_ir: به تعویق افتاده

source: Definition
fa_ir: تعریف

source: Delete
fa_ir: حذف

source: Delete selected lines.
fa_ir: حذف خطوط انتخاب شده.

source: Delete/Drop the selected object.
fa_ir: حذف/رها کردن شیئ انتخاب شده.

source: Delimiter
fa_ir: جدا کننده

source: Description
fa_ir: شرح

source: Design
fa_ir: طراحی

source: Dimensions
fa_ir: ابعاد

source: Disconnec&t
fa_ir: نا&مرتبط

source: Disconnect from the selected server.
fa_ir: قطع ارتباط از کارگزار انتخاب شده.

source: Display help on PostgreSQL database system.
fa_ir: نمابش راهنما بر سیستم بانک اطلاعاتی PostgreSQL.

source: Display help on SQL commands.
fa_ir: نمایش راهنما برای فرمان‌های SQL.

source: Display/edit the properties of the selected object.
fa_ir: نمایش/ویرایش مشخصات شیئ انتخاب شده.

source: Displays the current database status.
fa_ir: نمایش وضعیت کنونی بانک اطلاعات.

source: Do instead
fa_ir: بجایش انجام شود

source: Do instead?
fa_ir: بجایش انجام شود؟

source: Do not prompt for unsaved files on exit
fa_ir: در هنگام خروج از پرونده‌های ذخیره نشده سوال نشود

source: Do you want to save changes?
fa_ir: آیا می‌خواهید تغییرات داده شده را ذخیره نمایید؟

source: Domain
fa_ir: دامنه

source: Domains
fa_ir: دامنه‌ها

source: Done
fa_ir: انجام شد

source: Double right-handed joins are not allowed.
fa_ir: پیوست‌های دست-راستی دوگانه مجاز نمی‌باشند.

source: Drop
fa_ir: رها کردن

source: Drop %s?
fa_ir: رها کردن %s ؟

source: Drop the currently selected object.
fa_ir: رها کردن شیئ انتخاب شده‌ی کنونی.

source: E&xit
fa_ir: &خروج

source: E&xit Alt-F4
fa_ir: خ&روج Alt-F4

source: E&xplain
fa_ir: ت&وضیح

source: E&xplain F7
fa_ir: ت&وضیح F7

source: Element
fa_ir: عنصر

source: Enabled?
fa_ir: فعال شده؟

source: Encoding
fa_ir: کدگذاری

source: Encryption
fa_ir: رمزگذاری

source: Enter a description of this database connection.
fa_ir: شرحی را برای این ارتباط با بانک اطلاعات وارد نمایید.

source: Enter a filename to write application logs to.
fa_ir: نام پرونده‌ای را برای نگارش ثبت وقایع برنامه وارد نمایید.

source: Enter the hostname or IP address of the server to connect to.
fa_ir: نام کاربر میزبان یا نشانی اینترنتی کارگزاری را که میخواهید با آن ارتباط برقرار کنید را وارد نمایید.

source: Enter the name of the database on the server to use to make the initial connection. Normally this will be template1.
fa_ir: نام بانک اطلاعات بر روی کارگزارتان را برای شروع و آشناسازی ارتباط وارد نمایید. معمولا این الگوی ۱ خواهد بود.

source: Enter the password to use when connecting to the server.
fa_ir: گذرواژه‌ای را که برای ارتباط با کارگزار استفاده می‌شود را وارد نمایید

source: Enter the path or URL to the PostgreSQL documentation
fa_ir: مسیر یا URL به نوشتارهای PostgreSQL را وارد نمایید

source: Enter the port number that the server is listening on.
fa_ir: شماره درگاهی را که کارگزار به آن گوش میدهد را وارد نمایید.

source: Enter the username to use when connecting to the server.
fa_ir: نام کاربری را که برای تماس به کارگزار استفاده میشود را وارد نمایید.

source: Error connecting to the server: %s
fa_ir: خطا هنگام ارتباط به کارگزار: %s

source: Error!
fa_ir: خطا!

source: Error: No table or no column
fa_ir: خطا: هیج جدول یا ستونی

source: Errors and N&otices
fa_ir: خطاها و &توجهات

source: Errors, Notices, &SQL
fa_ir: خطاها, توجهات, &SQL

source: Event
fa_ir: رویداد

source: Events
fa_ir: رویدادها

source: Execute
fa_ir: اجرا

source: Execute arbitrary SQL queries.
fa_ir: اجرای پرسش‌های SQL اختیاری.

source: Execute query
fa_ir: اجرای پرسش

source: Exit query window
fa_ir: خروج از پنجره پرسش

source: Explain
fa_ir: توضیح

source: Explain &options
fa_ir: توضیح &گزینه‌ها

source: Explain analyse query
fa_ir: توضیح تحلیل پرسش

source: Explain query
fa_ir: توضیح پرسش

source: Explain verbose query
fa_ir: توضیح متنی پرسش

source: Export data to file
fa_ir: صدور داده‌ها به پرونده

source: Expression
fa_ir: عبارت

source: Expression Error
fa_ir: خطای عبارت

source: External
fa_ir: خارجی

source: Failed to open file %s.
fa_ir: ناموفق در باز کردن پرونده‌ی %s.

source: Failed to write to the output file: %s
fa_ir: ناموفق در نوشتن به پرونده برونداد: %s

source: File cannot be opened with this format. Please chose another format.
fa_ir: پرونده با این قالب نمی‌تواند باز شود. لطفا قالب دیگری را انتخاب نمایید.

source: Filename
fa_ir: نام پرونده

source: Final function
fa_ir: تابع نهایی

source: Final type
fa_ir: نوع نهایی

source: Find
fa_ir: یافتن

source: Find text
fa_ir: یافتن متن

source: Fires
fa_ir: شلیک کردن

source: Font
fa_ir: قلم

source: For each
fa_ir: برای هر یک

source: For type
fa_ir: برای نوع

source: Foreign Key
fa_ir: کلید خارجی

source: Foreign key?
fa_ir: کلید خارجی؟

source: Forward
fa_ir: به پیش

source: Forward to next page.
fa_ir: پیش به صفحه بعدی

source: Frequently asked questions about pgAdmin III.
fa_ir: سوالات پرسیده شده متداول درباره‌ی pgAdmin III.

source: From
fa_ir: از

source: Function
fa_ir: تابع

source: Functions
fa_ir: توابع

source: General
fa_ir: عمومی

source: Greater than operator
fa_ir: عامل بزرگتر از

source: Group
fa_ir: گروه

source: Group ID
fa_ir: شناسه گروه

source: Group/User
fa_ir: گروه‌/کاربر

source: Groups
fa_ir: گروه‌ها

source: HTTP proxy
fa_ir: پراکسی HTTP

source: Handler
fa_ir: دستگیره

source: Has OIDs
fa_ir: دارای OIDs

source: Has OIDs?
fa_ir: دارای OIDs؟

source: Help
fa_ir: راهنما

source: History
fa_ir: سرگذشت

source: Hostname
fa_ir: نام میزبان

source: Hostname/IP Address
fa_ir: نام میزبان/نشانی آی پی

source: How to send a bugreport to the pgAdmin Development Team.
fa_ir: چگونگی گزارش اشکال به گروه تولید کننده این برنامه.

source: Huh?
fa_ir: هان؟

source: Implementation
fa_ir: انجام دادن

source: Implicit
fa_ir: ضمنی

source: Incorrect password!
fa_ir: گذرواژه‌ی نادرست!

source: Increment
fa_ir: صعودی

source: Index
fa_ir: شاخص

source: Indexes
fa_ir: شاخص‌ها

source: Inherited
fa_ir: ارثی

source: Inherited from table %s
fa_ir: ارث رسیده از جدول %s

source: Inherited tables
fa_ir: جدول‌های ارث برده شده

source: Inherited tables count
fa_ir: شمارش جدول‌های ارث برده شده

source: Inherits from tables
fa_ir: ارثها از جدول‌ها

source: Inherits tables
fa_ir: ارث جدولها

source: Initial Database
fa_ir: آشناسازی بانک اطلاعات

source: Initial condition
fa_ir: آشناسازی شرط

source: Initial database
fa_ir: آشناسازی بانک اطلاعات

source: Initially?
fa_ir: در ابتدا؟

source: Input function
fa_ir: تابع درونداد

source: Input type
fa_ir: نوع درونداد

source: Internal length
fa_ir: طول درونی

source: Join
fa_ir: پیوستن

source: Join Type
fa_ir: نوع پیوست

source: Join function
fa_ir: تابع پیوند

source: Kind
fa_ir: جنس

source: Language
fa_ir: زبان

source: Languages
fa_ir: زبان‌ها

source: Last system OID
fa_ir: آخرین OID سیستم

source: Left Sort operator
fa_ir: عامل مرتب‌کننده به چپ

source: Left Table Columns
fa_ir: ستون‌های چپ جدول

source: Left sort op
fa_ir: عامل مرتب‌کننده به چپ

source: Left type
fa_ir: نوع چپ

source: Length
fa_ir: طول

source: Less Than operator
fa_ir: عامل کمتر از

source: Limit exceeded
fa_ir: از حد گذشته شده

source: Link symbol
fa_ir: نماد پیوند

source: Local
fa_ir: محلی

source: Local charset
fa_ir: مجموعه نویسه محلی

source: Local column
fa_ir: ستون محلی

source: Log Level
fa_ir: سطح ثبت‌

source: Log files (*.log)|*.log|All files (*.*)|*.*
fa_ir: پرونده‌های ثبت (*.log)|*.log|All files (*.*)|*.*

source: Logfile (%ID will be replaced with the Process ID)
fa_ir: پرونده‌ثبت (%ID با شناسه‌ی پروسه جایگرین خواهد شد)

source: Logging
fa_ir: در حال ثبت

source: Maintain %s %s
fa_ir: نگهداری %s %s

source: Maintain the current database or table.
fa_ir: نگهداری بانک اطلاعات یا جدول کنونی.

source: Maintenance
fa_ir: نگهداری

source: Maintenance operation
fa_ir: عملیات نگهداری

source: Max. characters per column
fa_ir: حداکثر نویسه‌ها در ستون

source: Maximum
fa_ir: حداکثر

source: Maximum rows to retrieve
fa_ir: حداکثر ردیف‌ها برای بازیافت

source: Maximums rows to retrieve into output window; 0 = unlimited
fa_ir: حداکثر ردیف‌ها برای بازیافت بدرون پنجره برونداد؛ ۰=بی‌اندازه

source: Member
fa_ir: عضو

source: Member count
fa_ir: شمارش عضو

source: Member name
fa_ir: نام عضو

source: Members
fa_ir: اعضا

source: Messages
fa_ir: پیغام‌ها

source: Minimum
fa_ir: حداقل

source: Moved
fa_ir: منتقل شده

source: Multiple Column Joins
fa_ir: پیوست دادن ستون‌های متعدد

source: Name
fa_ir: نام

source: Name may not start with '_'.
fa_ir: نام نمیتواند با '_' شروع شود.

source: New &Object
fa_ir: &شیی جدید

source: New Aggregate
fa_ir: Aggregate جدید

source: New Cast
fa_ir: Cast جدید

source: New Check Constraint
fa_ir: بررسی Constraint جدید

source: New Column
fa_ir: ستون جدید

source: New Conversion
fa_ir: Conversion جدید

source: New Database
fa_ir: بانک اطلاعات جدید

source: New Domain
fa_ir: دامنه‌ی جدید

source: New Foreign Key
fa_ir: کلید خارجی جدید

source: New Function
fa_ir: تابع جدید

source: New Group
fa_ir: گروه جدید

source: New Index
fa_ir: شاخص جدید

source: New Language
fa_ir: زبان جدید

source: New Operator
fa_ir: عامل جدید

source: New Operator Class
fa_ir: کلاس عامل جدید

source: New Password
fa_ir: گذرواژه‌ی جدید

source: New Primary Key
fa_ir: کلید مقدم جدید

source: New Rule
fa_ir: قاعده جدید

source: New Schema
fa_ir: طرح جدید

source: New Sequence
fa_ir: توالی جدید

source: New Server
fa_ir: کارگزار جدید

source: New Table
fa_ir: جدول جدید

source: New Trigger
fa_ir: Trigger جدید

source: New Trigger Function
fa_ir: تابع Trigger جدید

source: New Type
fa_ir: نوع جدید

source: New Unique Constraint
fa_ir: Constraint جدید یگانه

source: New User
fa_ir: کاربر جدید

source: New View
fa_ir: نمای جدید

source: New length must not be less than old length.
fa_ir: طول جدید نباید از طول قدیمی کمتر باشد.

source: New precision must not be less than old precision.
fa_ir: دقت جدید نباید از دقت قدیمی کمتر باشد.

source: New total digits must not be less than old total digits.
fa_ir: تعداد کل ارقام جدید نباید از تعداد کل ارقام قدیمی کمتر باشد.

source: No
fa_ir: نه

source: No Table or view.
fa_ir: نه جدول یا نما

source: No properties are available for the current selection
fa_ir: هیچ مشخصاتی برای انتخاب کنونی وجود ندارد.

source: No statistics are available for the current selection
fa_ir: هیچ آماری برای انتخاب کنونی وجود ندارد

source: None
fa_ir: هیچکدام

source: Not NULL
fa_ir: NULL نیست

source: Not NULL?
fa_ir: NULL نیست؟

source: Not implemented
fa_ir: پیاده‌سازی نشده است

source: Not implemented.
fa_ir: پیاده‌سازی نشده است.

source: Nothing
fa_ir: هیچ چیز

source: OK
fa_ir: تایید

source: OK.
fa_ir: تایید

source: Object file
fa_ir: پرونده شیئ

source: Open
fa_ir: باز کردن

source: Open a query file
fa_ir: باز کردن یک پرونده پرسش

source: Open file
fa_ir: باز کردن پرونده

source: Open query file
fa_ir: باز کردن پرونده پرسش

source: Open the pgAdmin III helpfile.
fa_ir: باز کردن پرونده‌ی راهنمای pdAdmin III.

source: Operator
fa_ir: عامل

source: Operator Class
fa_ir: کلاس عامل

source: Operator Classes
fa_ir: کلاس‌های عامل

source: Operator classes
fa_ir: کلاس‌های عامل

source: Operator function
fa_ir: تابع عامل

source: Operators
fa_ir: عامل‌ها

source: Options
fa_ir: گزینه‌ها

source: Options modifying Explain output
fa_ir: گزینه‌های تنظیم کننده‌ی توضیحات خروجی

source: Out of Memory for cacheLinePool
fa_ir: کتبود حافظه برای cacheLinePool

source: Output
fa_ir: برونداد

source: Output function
fa_ir: تابع برونداد

source: Owner
fa_ir: مالک

source: Parameter
fa_ir: پارامتر

source: Passed by Value?
fa_ir: آیا بوسیله‌ی مقدارش رد داده شود؟

source: Passed by value
fa_ir: بوسیله‌ی مقدارش رد داده شود

source: Password
fa_ir: گذرواژه

source: Password successfully changed!
fa_ir: گذرواژه‌ با موفقیت تغییر یافت!

source: Passwords do not match!
fa_ir: گذرواژه‌ها مطابقت ندارند!

source: Paste
fa_ir: چسباندن

source: Paste selected text from clipboard
fa_ir: چسباندن متن انتخاب شده از صفحه‌برش

source: Path
fa_ir: مسیر

source: Please choose user language:
fa_ir: لطفا زبان کاربر را انتخاب نمایید:

source: Please enter function definition.
fa_ir: لطفا‌ تعریف تابع را وارد نمایید

source: Please enter function source code.
fa_ir: لطفا‌ منبع کد تابع را وارد نمایید

source: Please select a datatype.
fa_ir: لطفا یک نوع‌ داده‌ای را انتخاب نمایید

source: Please select at an event.
fa_ir: لطفا یک رویداد را انتخاب نمایید

source: Please select base datatype.
fa_ir: لطفا یک نوع‌ داده‌ای پایه را انتخاب نمایید

source: Please select language.
fa_ir: لطفا زبان مورد نظر خود را انتخاب کنید.

source: Please select left or right datatype.
fa_ir: لطفا نوع‌ داده‌ای چپ یا راست را انتخاب نمایید

source: Please select return type.
fa_ir: لطفا نوع بازده را انتخاب نمایید

source: Please select state datatype.
fa_ir: لطفا نوع‌ داده‌ای عبارت را انتخاب نمایید

source: Please select target datatype.
fa_ir: لطفا نوع‌ داده‌ای هدف را انتخاب نمایید

source: Please specify a procedure.
fa_ir: لطفا یک رویه را مشخص نمایید

source: Please specify at least one action.
fa_ir: لطفا حداقل یک عملیات را مشخص نمایید.

source: Please specify at least two members.
fa_ir: لطفا حداقل دو عضو را مشخص نمایید.

source: Please specify columns.
fa_ir: لطفا ستون‌ها را مشخص نمایید.

source: Please specify condition.
fa_ir: لطفا شرط را مشخص نمایید.

source: Please specify conversion function.
fa_ir: لطفا تابع تبدیل کننده را مشخص نمایید.

source: Please specify input conversion function.
fa_ir: لطفا تابع تبدیل کننده درونداد را مشخص نمایید.

source: Please specify internal storage length.
fa_ir: لطفا طول ذخیره داخلی را مشخص نمایید
