Repository: pgadmin-org/pgadmin3
Catalog: src/ui/*/pgadmin3.po
Languages: fa_ir

source: Please specify language handler.
fa_ir: لطفا دستگیره زبان را مشخص نمایید.

source: Please specify name.
fa_ir: لطفا نام را مشخص نمایید.

source: Please specify object library.
fa_ir: لطفا کتابخانه شیئ را مشخص نمایید

source: Please specify output conversion function.
fa_ir: لطفا تابع تبدیل کننده برونداد را مشخص نمایید.

source: Please specify source datatype.
fa_ir: لطفا منبع نوع داده‌ای را مشخص نمایید.

source: Please specify source encoding.
fa_ir: لطفاً منبع کدگذاری را مشخص نمایید.

source: Please specify state function.
fa_ir: لطفا تابع وضعیت را انتخاب نمایید.

source: Please specify target encoding.
fa_ir: لطفاً هدف کدگذاری را مشخص نمایید

source: Please specify trigger function.
fa_ir: لطفا تابع trigger را انتخاب نمایید.

source: Please specify valid length.
fa_ir: لطفا طول معتبر را وارد نمایید.

source: Please specify valid numeric precision (0..
fa_ir: لطفا دقت اعشاری معتبر را مشخص نمایید (۰..

source: Port
fa_ir: درگاه

source: Position
fa_ir: موقعیت

source: PostgreSQL Description
fa_ir: توضیحات PostgreSQL

source: PostgreSQL Version
fa_ir: نسخه PostgreSQL

source: Precision
fa_ir: دقت

source: Primary Key
fa_ir: کلید مقدم

source: Primary key
fa_ir: کلید مقدم

source: Primary key?
fa_ir: کلید مقدم؟

source: Primary?
fa_ir: مقدم؟

source: Privileges
fa_ir: امتیازات

source: Problem with resource
fa_ir: مشکل با منبع

source: Procedure
fa_ir: رویه

source: Properties
fa_ir: مشخصات

source: Property
fa_ir: مشخصه

source: Query
fa_ir: پرسش

source: Query &builder
fa_ir: &سازنده پرسش

source: Query files (*.sql)|*.sql|All files (*.*)|*.*
fa_ir: پرونده‌های پرسش (*.sql)|*.sql|All files (*.*)|*.*

source: Query files (*.sql)|*.sql|UTF-8 query files (*.usql)|*.usql|All files (*.*)|*.*
fa_ir: پرونده‌های پرسش (*.sql)|*.sql|UTF-8 query files (*.usql)|*.usql|All files (*.*)|*.*

source: Query is running.
fa_ir: پرسش در حال اجرا می‌باشد.

source: Query result with %d rows discarded.
fa_ir: نتیجه پرسش با %d ردیف منتفی شد.

source: Query result with %d rows will be returned.
fa_ir: نتیجه پرسش با %d ردیف بازگشت داده خواهد شد.

source: Query returned successfully with no result in %s ms.
fa_ir: پرسش با موفقیت و بدون هیچ نتیجه‌ای در %s ms بازگشت داده شد.

source: Query tool
fa_ir: ابزار پرسش

source: Quit this program.
fa_ir: خروج از این برنامه.

source: Quote char
fa_ir: نویسه سهمیه

source: Quoting
fa_ir: سهمیه

source: REINDEX options
fa_ir: گزینه‌های REINDEX

source: Re&fresh F5
fa_ir: نو&سازی F5

source: Re&load module
fa_ir: بار&گزاری مجدد بخش

source: Reached end of the document
fa_ir: به آخر نوشتار رسیده شد

source: Read and write Unicode UTF-8 files
fa_ir: خواندن و نوشتن پرونده‌های یونی کد

source: Ready.
fa_ir: آماده.

source: Receive function
fa_ir: تابع دریافت

source: Redo
fa_ir: بازانجام

source: Redo last action
fa_ir: بازانجام آخرین عملیات

source: Referenced
fa_ir: ارجاع شده

source: References
fa_ir: مرجع‌ها

source: Referencing
fa_ir: ارجاع کردن

source: Refresh
fa_ir: نوسازی

source: Refresh rate (seconds)
fa_ir: میزان نوسازی (ثانیه)

source: Refresh the selected object.
fa_ir: نوسازی شیئ انتخاب شده.

source: Refresh to count rows
fa_ir: نوسازی برای شمارش ردیف‌ها

source: Refreshing %s...
fa_ir: نوسازی %s...

source: Refreshing data, please wait.
fa_ir: نوسازی داده‌ها، لطفا صبرنمایید.

source: Reload
fa_ir: بارگزاری مجدد

source: Reload current page.
fa_ir: بارگزاری مجدد صفحه کنونی

source: Reload library module which implements this function.
fa_ir: بارگزاری مجدد کتابخانه بخش که این تابع را تکمیل می‌کند

source: Remove
fa_ir: برداشتن

source: Restoring previous environment
fa_ir: بازسازی محیط پیشین

source: Restrict function
fa_ir: تابع Restrict

source: Result type
fa_ir: نوع نتیجه

source: Retrieving %s details
fa_ir: دریافت جزییات %s

source: Retrieving data: %d rows.
fa_ir: دریافت داده‌ها: %d ردیف.

source: Retrieving server properties
fa_ir: بازیافت مشخصات کارگزار

source: Return type
fa_ir: نوع برگردان

source: Returns a set?
fa_ir: یک مجموعه را برمیگرداند؟

source: Returns set
fa_ir: برگردان یک مجموعه

source: Right Sort operator
fa_ir: عامل ترتیب به راست

source: Right Table Columns
fa_ir: ستون‌های راست جدول

source: Right sort op
fa_ir: عامل ترتیب به راست

source: Right type
fa_ir: نوع راست

source: Row
fa_ir: ردیف

source: Row separator
fa_ir: جداساز ردیف

source: Row trigger
fa_ir: trigger ردیف

source: Rows (counted)
fa_ir: ردیف‌ها (شمرده شده)

source: Rows (estimated)
fa_ir: ردیف‌ها (تخمینی)

source: Rule
fa_ir: قاعده

source: Rules
fa_ir: قواعد

source: SQL Help
fa_ir: راهنمای SQL

source: SQL help site
fa_ir: پایگاه راهنمای SQL

source: SSL Mode
fa_ir: حالت SSL

source: SSL encrypted
fa_ir: رمز شده با SSL

source: Save
fa_ir: ذخیره

source: Save &as...
fa_ir: ذخیره &به‌عنوان

source: Save current file
fa_ir: ذخیره پرونده کنونی

source: Save file
fa_ir: ذخیره‌ی پرونده

source: Save file under new name
fa_ir: ذخیره‌ی پرونده با نام جدید

source: Save history
fa_ir: ذخیره سرگذشت

source: Save history of executed commands.
fa_ir: ذخیره سرگذشت فرمانهای اجرا شده.

source: Save query file as
fa_ir: ذخیره پرونده‌ی پرسش با نام

source: Save the SQL definition of the selected object.
fa_ir: ذخیره تعریف SQL شیئ انتخاب شده.

source: Saved the changed row.
fa_ir: ردیف تغییر کرده ذخیره شد.

source: Schema
fa_ir: طرح

source: Schemas
fa_ir: طرح‌ها

source: Security
fa_ir: امنیت

source: Security of definer
fa_ir: امنیت معرف

source: Security of definer?
fa_ir: امنیت معرف؟

source: Select &All
fa_ir: انتخاب &همه

source: Select export filename
fa_ir: انتخاب اسم پرونده صادر شونده

source: Select log file
fa_ir: انتخاب پرونده‌ی ثبت

source: Select output file
fa_ir: انتخاب پرونده برونداد

source: Select the level of detail to record in the logfile.
fa_ir: انتخاب سطح جزئیات برای ضبط در پرونده‌ی ثبت

source: Send Function
fa_ir: تابع Send

source: Send function
fa_ir: تابع Send

source: Sequence
fa_ir: توالی

source: Sequences
fa_ir: توالی‌ها

source: Server
fa_ir: کارگزار‌

source: Servers
fa_ir: کارگزارها

source: Servers (%d)
fa_ir: کارگزارها (%d)

source: Show a tip of the day.
fa_ir: نمایش یک نکته ‌راهنمای روز.

source: Show about dialog.
fa_ir: نمایش گفتگوی درباره.

source: Show object properties on double click in treeview?
fa_ir: نمایش مشخصات شیئ با کلیک دوگانه در درخت‌نما؟

source: Show options dialog.
fa_ir: نمایش گفتگوی مشخصات.

source: Show or hide system objects.
fa_ir: نمایش یا پنهان‌سازی اشیای سیستم

source: Show users for privileges?
fa_ir: نمایش کاربرها برای امتیازات؟

source: Source
fa_ir: منبع

source: Source encoding
fa_ir: منبع کدگذاری

source: Source type
fa_ir: نوع منبع

source: Start
fa_ir: شروع

source: Start the query builder.
fa_ir: شروع کردن سازنده پرسش.

source: State function
fa_ir: تابع State

source: State type
fa_ir: نوع State

source: Statistic
fa_ir: آمار

source: Statistics
fa_ir: آمار‌ها

source: Storage
fa_ir: انبار

source: Strict
fa_ir: اکید

source: Strict?
fa_ir: اکید؟

source: Superuser?
fa_ir: فوق کاربر؟

source: Supports hash
fa_ir: پشتیبانی از hash

source: Supports hash?
fa_ir: پشتیبانی از hash؟

source: Supports merge
fa_ir: پشتیبانی از ادغام

source: System aggregate?
fa_ir: aggregate سیستم؟

source: System cast?
fa_ir: cast سیستم؟

source: System column?
fa_ir: ستون سیستم؟

source: System conversion?
fa_ir: conversion سیستم؟

source: System database?
fa_ir: بانک اطلاعات سیستم؟

source: System domain?
fa_ir: دامنه‌ی سیستم؟

source: System foreign key?
fa_ir: کلید خارجی سیستم؟

source: System function?
fa_ir: تابع سیستم؟

source: System index?
fa_ir: شاخص سیستم؟

source: System language?
fa_ir: زبان سیستم؟

source: System operator class?
fa_ir: رده عامل سیستم؟

source: System operator?
fa_ir: عامل سیستم؟

source: System rule?
fa_ir: قاعده‌ی سیستم؟

source: System schema?
fa_ir: طرح سیستم؟

source: System sequence?
fa_ir: توالی سیستم؟

source: System table?
fa_ir: جدول سیستم؟

source: System trigger?
fa_ir: Trigger سیستم؟

source: System type?
fa_ir: نوع سیستم؟

source: System view?
fa_ir: نمای سیستم؟

source: Table
fa_ir: جدول

source: Tables
fa_ir: جدول‌ها

source: Tables/Views
fa_ir: جدول‌ها/نماها

source: Target encoding
fa_ir: کدگذاری هدف

source: Target type
fa_ir: نوع هدف

source: Template
fa_ir: الگو

source: The PostgreSQL server must be at least version %2.1f!
fa_ir: کارگزار PostgreSQL باید حداقل نسخه %2.1f باشد!

source: The PostgreSQL server's version string.
fa_ir: رشته‌ی نسخه کارگزار PostgreSQL.

source: The PostgreSQL version number.
fa_ir: شماره نسخه PostgreSQL

source: The hostname or TCP/IP address of the server.
fa_ir: نام کارگزار یا نشانی TCP/IP کارگزار.

source: The initial database used when connecting to the server.
fa_ir: بانک اطلاعات شروعی برای ارتباط با کارگزار استفاده می‌شود

source: The last OID used by the server.
fa_ir: آخرین OID بوسیله کارگزار استفاده شد.

source: The maximum of %ld rows is exceeded (total %ld).
fa_ir: حداکثر %ld ردیف بدست رسید تعداد کل %ld

source: The password could not be changed!
fa_ir: گذرواژه نمی‌تواند عوض شود!

source: The port number the server is listening on.
fa_ir: شماره درگاهی که کارگزار به آن گوش میدهد.

source: The text %s has changed.
fa_ir: متن %s تغییر کرده است.

source: The text %s has changed. Do you want to save changes?
fa_ir: متن %s تغییر کرده است. آیا میخواهید این تغییرات را ذخیره نمایید؟

source: The username used when connecting to the server.
fa_ir: نام کاربری مورد استفاده هنگام ارتباط با کارگزار.

source: There is nothing in the SQL pane to save!
fa_ir: چیزی در جام SQL برای ذخیره شدن وجود ندارد!

source: There is unsaved data in a row. Do you want to store to the database?
fa_ir: داده ذخیره نشده در یک ردیف وجود دارد. آیا میخواهید در بانک اطلاعات ذخیره شود؟

source: This query will return %d results. Load all results?
fa_ir: این پرسش %d نتیجه را بازگشت میدهد. تمام نتایج بارگزاری شوند؟

source: This software is released under the Artistic License.
fa_ir: این برنامه تحت اجازه‌نامه‌ی هنری پخش شده است

source: To
fa_ir: به

source: Total %ld rows.
fa_ir: در کل %ld ردیف.

source: Total query runtime:
fa_ir: کل زمان اجرای پرسش:

source: Trigger Function
fa_ir: تابع Trigger

source: Trigger Functions
fa_ir: تابع‌های Trigger

source: Trigger function
fa_ir: تابع Trigger

source: Trusted
fa_ir: معتمد

source: Trusted?
fa_ir: معتمد؟

source: Try switching it to the lefthand side in one or more relationships.
fa_ir: سعی کنید در یک یا چند رابطه به سمت دست چپ تعویض نمایید.

source: Trying to drop system object
fa_ir: سعی می‌شود شیئ سیستم رها شود

source: Type
fa_ir: نوع

source: Types
fa_ir: انواع

source: Undo
fa_ir: بازگشت

source: Undo change of data.
fa_ir: تغییر داده برگشت داده شود

source: Undo last action
fa_ir: بازگشت آخرین عملیات

source: Unexpected empty cache line: dataSet already closed.
fa_ir: خط خالی حافظه cache غیرمنتظره: dataSet قبلا بسته شده است.

source: Unicode UTF-8
fa_ir: یونی‌کد UTF-8

source: Unique
fa_ir: یگانه

source: Unique?
fa_ir: یگانه؟

source: Unknown
fa_ir: ناشناس

source: Unknown find dialog event!
fa_ir: رویداد گفتگوی ناشناس یافت شد!

source: Unsaved data
fa_ir: داده ذخیره نشده‌

source: Update catalogs?
fa_ir: بروزسازی پوشه‌ها؟

source: User
fa_ir: کاربر

source: User ID
fa_ir: شناسه کاربر

source: User Privileges
fa_ir: امتیازات کاربر

source: User can create databases
fa_ir: کاربر می‌تواند بانک‌های اطلاعات را ایجاد نماید

source: User can create users
fa_ir: کاربر می‌تواند کاربرها را ایجاد نماید

source: User language
fa_ir: زبان کاربر

source: User/Group
fa_ir: کاربر/گروه

source: Username
fa_ir: نام‌کاربر

source: Users
fa_ir: کاربران

source: VACUUM options
fa_ir: گزینه‌های VACUUM

source: Validator
fa_ir: اعتبارسنج

source: Value
fa_ir: مقدار

source: Variable
fa_ir: متغیر

source: Variable Name
fa_ir: نام متغیر

source: Variable Value
fa_ir: ارزش متغیر

source: Variables
fa_ir: متغیرها

source: Verbose
fa_ir: متنی

source: Verbose messages
fa_ir: پیغامهای متنی

source: Version number
fa_ir: شماره نسخه

source: Version string
fa_ir: رشته نسخه

source: View
fa_ir: نما

source: View &Data
fa_ir: نمای &داده‌ها

source: View Data
fa_ir: نمای داده‌ها

source: View the data in the selected object.
fa_ir: نمایی از داده‌ها در شیئ انتخاب شده

source: Views
fa_ir: نماها

source: Volatility
fa_ir: فرّاری

source: Warning:
fa_ir: هشدار:

source: Yes
fa_ir: آری

source: You cannot join on the asterisk.
fa_ir: شما نمی‌توانید با ستاره پیوست نمایید.

source: You cannot leave both the column and expression blank. Click 'OK' to insert a default function into the expression.
fa_ir: شما نمی‌توانید هم ستون و هم عبارت را خالی بگذارید. تکمه تایید را برای وارد کردن تابع پیش‌فرض بدرون عبارت کلیک نمایید

source: You must add at least on column.
fa_ir: شما باید حداقل یک ستون را اضافه نمایید

source: You must redraw your joins so that "%s" does not appear on the righthand side more than once.
fa_ir: شما باید پیوست‌های خود را برای اینکه "%s" بیش از یکبار در سمت راست ظاهر نشود دوباره رسم نمایید.

source: You must select a server before changing your password!
fa_ir: شما باید یک کارگزار را قبل از عوض کردن واژه‌ی رمز خود انتخاب نمایید!

source: You must select one column from the left table and one column from the right table.
fa_ir: شما باید یک ستون از جدول سمت چپ و یک ستون از جدول سمت راست انتخاب نمایید.

source: aborting.
fa_ir: سقط کردن

source: all columns
fa_ir: تمام ستونها

source: allow
fa_ir: اجازه

source: char
fa_ir: نویسه

source: disable
fa_ir: غیرفعال

source: double
fa_ir: دوگانه

source: member
fa_ir: عضو

source: no quoting
fa_ir: بدون سهمیه سازی

source: not encrypted
fa_ir: رمزی نشده

source: not member
fa_ir: عضو نمی‌باشد

source: only strings
fa_ir: فقط رشته‌ها

source: pgServer object didn't initialise because the user aborted.
fa_ir: شیئ pgServer نتوانست بعلت سقط کاربر آشناسازی را شروع کند.

source: prefer
fa_ir: ترجیح

source: ready
fa_ir: آماده

source: require
fa_ir: لازم

source: template1
fa_ir: الگوی ۱
