<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>Authentication methods</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REV="MADE"
HREF="mailto:pgsql-docs@postgresql.org"><LINK
REL="HOME"
TITLE="PostgreSQL 7.4beta4 Documentation"
HREF="index.html"><LINK
REL="UP"
TITLE="Client Authentication"
HREF="client-authentication.html"><LINK
REL="PREVIOUS"
TITLE="Client Authentication"
HREF="client-authentication.html"><LINK
REL="NEXT"
TITLE="Authentication problems"
HREF="client-authentication-problems.html"><LINK
REL="STYLESHEET"
TYPE="text/css"
HREF="stylesheet.css"><META
NAME="creation"
CONTENT="2003-10-03T03:19:47"></HEAD
><BODY
CLASS="SECT1"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="5"
ALIGN="center"
VALIGN="bottom"
>PostgreSQL 7.4beta4 Documentation</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="top"
><A
HREF="client-authentication.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="top"
><A
HREF="client-authentication.html"
>Fast Backward</A
></TD
><TD
WIDTH="60%"
ALIGN="center"
VALIGN="bottom"
>Chapter 19. Client Authentication</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="top"
><A
HREF="client-authentication.html"
>Fast Forward</A
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="top"
><A
HREF="client-authentication-problems.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="AUTH-METHODS"
>19.2. Authentication methods</A
></H1
><P
>   The following describes the authentication methods in more detail.
  </P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AUTH-TRUST"
>19.2.1. Trust authentication</A
></H2
><P
>    When <VAR
CLASS="LITERAL"
>trust</VAR
> authentication is specified,
    <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> assumes that anyone who can
    connect to the server is authorized to access the database as
    whatever database user he specifies (including the database superuser).
    This method should only be used when there is adequate operating system-level
    protection on connections to the server.
   </P
><P
>    <VAR
CLASS="LITERAL"
>trust</VAR
> authentication is appropriate and very
    convenient for local connections on a single-user workstation.  It
    is usually <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>not</I
></SPAN
> appropriate by itself on a multiuser
    machine.  However, you may be able to use <VAR
CLASS="LITERAL"
>trust</VAR
> even
    on a multiuser machine, if you restrict access to the server's
    Unix-domain socket file using file-system permissions.  To do this, set the
    <VAR
CLASS="VARNAME"
>unix_socket_permissions</VAR
> (and possibly
    <VAR
CLASS="VARNAME"
>unix_socket_group</VAR
>) configuration parameters as
    described in <A
HREF="runtime-config.html#RUNTIME-CONFIG-CONNECTION"
>Section 16.4.1</A
>.  Or you
    could set the <VAR
CLASS="VARNAME"
>unix_socket_directory</VAR
>
    configuration parameter to place the socket file in a suitably
    restricted directory.
   </P
><P
>    Setting file-system permissions only helps for Unix-socket connections.
    Local TCP/IP connections are not restricted by it; therefore, if you want
    to use file-system permissions for local security, remove the <VAR
CLASS="LITERAL"
>host ...
    127.0.0.1 ...</VAR
> line from <TT
CLASS="FILENAME"
>pg_hba.conf</TT
>, or change it to a
    non-<VAR
CLASS="LITERAL"
>trust</VAR
> authentication method.
   </P
><P
>    <VAR
CLASS="LITERAL"
>trust</VAR
> authentication is only suitable for TCP/IP connections
    if you trust every user on every machine that is allowed to connect
    to the server by the <TT
CLASS="FILENAME"
>pg_hba.conf</TT
> lines that specify
    <VAR
CLASS="LITERAL"
>trust</VAR
>.  It is seldom reasonable to use <VAR
CLASS="LITERAL"
>trust</VAR
>
    for any TCP/IP connections other than those from <SPAN
CLASS="SYSTEMITEM"
>localhost</SPAN
> (127.0.0.1).
   </P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AUTH-PASSWORD"
>19.2.2. Password authentication</A
></H2
><A
NAME="AEN17926"
></A
><A
NAME="AEN17928"
></A
><A
NAME="AEN17930"
></A
><P
>    The password-based authentication methods are <VAR
CLASS="LITERAL"
>md5</VAR
>,
    <VAR
CLASS="LITERAL"
>crypt</VAR
>, and <VAR
CLASS="LITERAL"
>password</VAR
>. These methods operate
    similarly except for the way that the password is sent across the
    connection. If you are at all concerned about password
    <SPAN
CLASS="QUOTE"
>"sniffing"</SPAN
> attacks then <VAR
CLASS="LITERAL"
>md5</VAR
> is preferred, with
    <VAR
CLASS="LITERAL"
>crypt</VAR
> a second choice if you must support pre-7.2
    clients. Plain <VAR
CLASS="LITERAL"
>password</VAR
> should especially be avoided for
    connections over the open Internet (unless you use SSL, SSH, or
    other communications security wrappers around the connection).
   </P
><P
>    <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> database passwords are
    separate from operating system user passwords. The password for
    each database user is stored in the <VAR
CLASS="LITERAL"
>pg_shadow</VAR
> system
    catalog table. Passwords can be managed with the SQL
    commands <TT
CLASS="COMMAND"
>CREATE USER</TT
> and <TT
CLASS="COMMAND"
>ALTER
    USER</TT
>, e.g., <KBD
CLASS="USERINPUT"
>CREATE USER foo WITH PASSWORD
    'secret';</KBD
>. By default, that is, if no password has
    been set up, the stored password is null and
    password authentication will always fail for that user.
   </P
><P
>    To restrict the set of users that are allowed to connect to
    certain databases, list the users in the <VAR
CLASS="REPLACEABLE"
>user</VAR
>
    column of <TT
CLASS="FILENAME"
>pg_hba.conf</TT
>, as explained in the
    previous section.
   </P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="KERBEROS-AUTH"
>19.2.3. Kerberos authentication</A
></H2
><A
NAME="AEN17952"
></A
><P
>    <SPAN
CLASS="PRODUCTNAME"
>Kerberos</SPAN
> is an industry-standard secure
    authentication system suitable for distributed computing over a public
    network. A description of the <SPAN
CLASS="PRODUCTNAME"
>Kerberos</SPAN
> system
    is far beyond the scope of this document; in all generality it can be
    quite complex (yet powerful). The <A
HREF="http://www.nrl.navy.mil/CCS/people/kenh/kerberos-faq.html"
TARGET="_top"
>Kerberos
    <ACRONYM
CLASS="ACRONYM"
>FAQ</ACRONYM
></A
> or <A
HREF="ftp://athena-dist.mit.edu"
TARGET="_top"
>MIT
    Project Athena</A
> can be a good starting point for exploration.
    Several sources for <SPAN
CLASS="PRODUCTNAME"
>Kerberos</SPAN
> distributions exist.
   </P
><P
>    While <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> supports both Kerberos 4 and 
    Kerberos 5, only Kerberos 5 is recommended.  Kerberos 4 is
    considered insecure and no longer recommended for general
    use.
   </P
><P
>    In order to use <SPAN
CLASS="PRODUCTNAME"
>Kerberos</SPAN
>, support for it must be
    enabled at build time.  See <A
HREF="installation.html"
>Chapter 14</A
> for more
    information.  Both Kerberos 4 and 5 are supported, but only one
    version can be supported in any one build.
   </P
><P
>    <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> operates like a normal Kerberos service.
    The name of the service principal is
    <VAR
CLASS="LITERAL"
><VAR
CLASS="REPLACEABLE"
>servicename</VAR
>/<VAR
CLASS="REPLACEABLE"
>hostname</VAR
>@<VAR
CLASS="REPLACEABLE"
>realm</VAR
></VAR
>, where
    <VAR
CLASS="REPLACEABLE"
>servicename</VAR
> is <VAR
CLASS="LITERAL"
>postgres</VAR
> (unless a
    different service name was selected at configure time with
    <VAR
CLASS="LITERAL"
>./configure --with-krb-srvnam=whatever</VAR
>).
    <VAR
CLASS="REPLACEABLE"
>hostname</VAR
> is the fully qualified host name of the
    server machine. The service principal's realm is the preferred realm
    of the server machine.
   </P
><P
>    Client principals must have their <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> user
    name as their first component, for example
    <VAR
CLASS="LITERAL"
>pgusername/otherstuff@realm</VAR
>. At present the realm of
    the client is not checked by <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
>; so if you
    have cross-realm authentication enabled, then any principal in any
    realm that can communicate with yours will be accepted.
   </P
><P
>    Make sure that your server key file is readable (and preferably only
    readable) by the <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> server
    account.  (See also <A
HREF="runtime.html#POSTGRES-USER"
>Section 16.1</A
>). The location of the
    key file is specified with the <VAR
CLASS="VARNAME"
>krb_server_keyfile</VAR
> run-time
    configuration parameter. (See also <A
HREF="runtime-config.html"
>Section 16.4</A
>.) The default is <TT
CLASS="FILENAME"
>/etc/srvtab</TT
>
    if you are using Kerberos 4 and
    <TT
CLASS="FILENAME"
>FILE:/usr/local/pgsql/etc/krb5.keytab</TT
> (or whichever
    directory was specified as <VAR
CLASS="VARNAME"
>sysconfdir</VAR
> at build time)
    with Kerberos 5.
   </P
><P
>    To generate the keytab file, use for example (with version 5)
</P><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>kadmin% </SAMP
><KBD
CLASS="USERINPUT"
>ank -randkey postgres/server.my.domain.org</KBD
>
<SAMP
CLASS="PROMPT"
>kadmin% </SAMP
><KBD
CLASS="USERINPUT"
>ktadd -k krb5.keytab postgres/server.my.domain.org</KBD
></PRE
><P>
    Read the <SPAN
CLASS="PRODUCTNAME"
>Kerberos</SPAN
> documentation for details.
   </P
><P
>    When connecting to the database make sure you have a ticket for a
    principal matching the requested database user name. An example: For
    database user name <VAR
CLASS="LITERAL"
>fred</VAR
>, both principal
    <VAR
CLASS="LITERAL"
>fred@EXAMPLE.COM</VAR
> and
    <VAR
CLASS="LITERAL"
>fred/users.example.com@EXAMPLE.COM</VAR
> can be used to
    authenticate to the database server.
   </P
><P
>    If you use <SPAN
CLASS="APPLICATION"
>mod_auth_kerb</SPAN
> from
    <A
HREF="http://modauthkerb.sf.net"
TARGET="_top"
>http://modauthkerb.sf.net</A
>
    and <SPAN
CLASS="APPLICATION"
>mod_perl</SPAN
> on your
    <SPAN
CLASS="PRODUCTNAME"
>Apache</SPAN
> web server, you can use
    <VAR
CLASS="LITERAL"
>AuthType KerberosV5SaveCredentials</VAR
> with a
    <SPAN
CLASS="APPLICATION"
>mod_perl</SPAN
> script. This gives secure
    database access over the web, no extra passwords required.
   </P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AUTH-IDENT"
>19.2.4. Ident-based authentication</A
></H2
><A
NAME="AEN18008"
></A
><P
>    The ident authentication method works by inspecting the client's
    operating system user name and determining the allowed database
    user names by using a map file that lists the permitted
    corresponding user name pairs.  The determination of the client's
    user name is the security-critical point, and it works differently
    depending on the connection type.
   </P
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN18011"
>19.2.4.1. Ident Authentication over TCP/IP</A
></H3
><P
>    The <SPAN
CLASS="QUOTE"
>"Identification Protocol"</SPAN
> is described in
    <I
CLASS="CITETITLE"
>RFC 1413</I
>. Virtually every Unix-like
    operating system ships with an ident server that listens on TCP
    port 113 by default. The basic functionality of an ident server
    is to answer questions like <SPAN
CLASS="QUOTE"
>"What user initiated the
    connection that goes out of your port <VAR
CLASS="REPLACEABLE"
>X</VAR
>
    and connects to my port <VAR
CLASS="REPLACEABLE"
>Y</VAR
>?"</SPAN
>.
    Since <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> knows both <VAR
CLASS="REPLACEABLE"
>X</VAR
> and
    <VAR
CLASS="REPLACEABLE"
>Y</VAR
> when a physical connection is established, it
    can interrogate the ident server on the host of the connecting
    client and could theoretically determine the operating system user
    for any given connection this way.
   </P
><P
>    The drawback of this procedure is that it depends on the integrity
    of the client: if the client machine is untrusted or compromised
    an attacker could run just about any program on port 113 and
    return any user name he chooses. This authentication method is
    therefore only appropriate for closed networks where each client
    machine is under tight control and where the database and system
    administrators operate in close contact. In other words, you must
    trust the machine running the ident server.
    Heed the warning:
    <A
NAME="AEN18023"
></A
><TABLE
BORDER="0"
WIDTH="100%"
CELLSPACING="0"
CELLPADDING="0"
CLASS="BLOCKQUOTE"
><TR
><TD
WIDTH="10%"
VALIGN="TOP"
>&nbsp;</TD
><TD
VALIGN="TOP"
><P
>      The Identification Protocol is not intended as an authorization
      or access control protocol.
     </P
></TD
><TD
WIDTH="10%"
VALIGN="TOP"
>&nbsp;</TD
></TR
><TR
><TD
COLSPAN="2"
ALIGN="RIGHT"
VALIGN="TOP"
>--<SPAN
CLASS="ATTRIBUTION"
>RFC 1413</SPAN
></TD
><TD
WIDTH="10%"
>&nbsp;</TD
></TR
></TABLE
>
   </P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN18026"
>19.2.4.2. Ident Authentication over Local Sockets</A
></H3
><P
>    On systems supporting <TT
CLASS="SYMBOL"
>SO_PEERCRED</TT
> requests for
    Unix-domain sockets (currently <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>, <SPAN
CLASS="SYSTEMITEM"
>FreeBSD</SPAN
>,
    <SPAN
CLASS="SYSTEMITEM"
>NetBSD</SPAN
>, <SPAN
CLASS="SYSTEMITEM"
>OpenBSD</SPAN
>, 
    and <SPAN
CLASS="SYSTEMITEM"
>BSD/OS</SPAN
>), ident authentication can also 
    be applied to local connections. In this case, no security risk is added by
    using ident authentication; indeed it is a preferable choice for
    local connections on such systems.
   </P
><P
>     On systems without <TT
CLASS="SYMBOL"
>SO_PEERCRED</TT
> requests, ident
     authentication is only available for TCP/IP connections. As a
     work around, it is possible to specify the <SPAN
CLASS="SYSTEMITEM"
>localhost</SPAN
> address <SPAN
CLASS="SYSTEMITEM"
>127.0.0.1</SPAN
> and make connections to this
     address.
    </P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN18039"
>19.2.4.3. Ident Maps</A
></H3
><P
>    When using ident-based authentication, after having determined the
    name of the operating system user that initiated the connection,
    <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> checks whether that user is
    allowed to connect as the database user he is requesting to connect
    as. This is controlled by the ident map argument that follows the
    <VAR
CLASS="LITERAL"
>ident</VAR
> key word in the <TT
CLASS="FILENAME"
>pg_hba.conf</TT
>
    file. There is a predefined ident map <VAR
CLASS="LITERAL"
>sameuser</VAR
>,
    which allows any operating system user to connect as the database
    user of the same name (if the latter exists). Other maps must be
    created manually.
   </P
><P
>    Ident maps
    other than <VAR
CLASS="LITERAL"
>sameuser</VAR
> are defined in the file
    <TT
CLASS="FILENAME"
>pg_ident.conf</TT
><A
NAME="AEN18049"
></A
>
    in the data directory, which contains lines of the general form:
</P><PRE
CLASS="SYNOPSIS"
><VAR
CLASS="REPLACEABLE"
>map-name</VAR
> <VAR
CLASS="REPLACEABLE"
>ident-username</VAR
> <VAR
CLASS="REPLACEABLE"
>database-username</VAR
></PRE
><P>
    Comments and whitespace are handled in the usual way. The
    <VAR
CLASS="REPLACEABLE"
>map-name</VAR
> is an arbitrary name that will be used to
    refer to this mapping in <TT
CLASS="FILENAME"
>pg_hba.conf</TT
>. The other
    two fields specify which operating system user is allowed to connect
    as which database user. The same <VAR
CLASS="REPLACEABLE"
>map-name</VAR
> can be
    used repeatedly to specify more user-mappings within a single map.
    There is no restriction regarding how many database users a given
    operating system user may correspond to and vice versa.
   </P
><P
>   The <TT
CLASS="FILENAME"
>pg_ident.conf</TT
> file is read on start-up and
   when the main server process (<TT
CLASS="COMMAND"
>postmaster</TT
>) receives a
   <SPAN
CLASS="SYSTEMITEM"
>SIGHUP</SPAN
><A
NAME="AEN18062"
></A
>
   signal. If you edit the file on an
   active system, you will need to signal the <TT
CLASS="COMMAND"
>postmaster</TT
>
   (using <VAR
CLASS="LITERAL"
>pg_ctl reload</VAR
> or <VAR
CLASS="LITERAL"
>kill -HUP</VAR
>) to make it
   re-read the file.
  </P
><P
>    A <TT
CLASS="FILENAME"
>pg_ident.conf</TT
> file that could be used in
    conjunction with the <TT
CLASS="FILENAME"
>pg_hba.conf</TT
> file in <A
HREF="client-authentication.html#EXAMPLE-PG-HBA.CONF"
>Example 19-1</A
> is shown in <A
HREF="auth-methods.html#EXAMPLE-PG-IDENT.CONF"
>Example 19-2</A
>. In this example setup, anyone
    logged in to a machine on the 192.168 network that does not have the
    Unix user name <VAR
CLASS="LITERAL"
>bryanh</VAR
>, <VAR
CLASS="LITERAL"
>ann</VAR
>, or
    <VAR
CLASS="LITERAL"
>robert</VAR
> would not be granted access. Unix user
    <VAR
CLASS="LITERAL"
>robert</VAR
> would only be allowed access when he tries to
    connect as <SPAN
CLASS="PRODUCTNAME"
>PostgreSQL</SPAN
> user <VAR
CLASS="LITERAL"
>bob</VAR
>, not
    as <VAR
CLASS="LITERAL"
>robert</VAR
> or anyone else. <VAR
CLASS="LITERAL"
>ann</VAR
> would
    only be allowed to connect as <VAR
CLASS="LITERAL"
>ann</VAR
>. User
    <VAR
CLASS="LITERAL"
>bryanh</VAR
> would be allowed to connect as either
    <VAR
CLASS="LITERAL"
>bryanh</VAR
> himself or as <VAR
CLASS="LITERAL"
>guest1</VAR
>.
   </P
><DIV
CLASS="EXAMPLE"
><A
NAME="EXAMPLE-PG-IDENT.CONF"
></A
><P
><B
>Example 19-2. An example <TT
CLASS="FILENAME"
>pg_ident.conf</TT
> file</B
></P
><PRE
CLASS="PROGRAMLISTING"
># MAPNAME     IDENT-USERNAME    PG-USERNAME

omicron       bryanh            bryanh
omicron       ann               ann
# bob has user name robert on these machines
omicron       robert            bob
# bryanh can also connect as guest1
omicron       bryanh            guest1</PRE
></DIV
></DIV
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AUTH-PAM"
>19.2.5. PAM Authentication</A
></H2
><A
NAME="AEN18090"
></A
><P
>    This authentication method operates similarly to
    <VAR
CLASS="LITERAL"
>password</VAR
> except that it uses PAM (Pluggable
    Authentication Modules) as the authentication mechanism. The
    default PAM service name is <VAR
CLASS="LITERAL"
>postgresql</VAR
>. You can
    optionally supply you own service name after the <VAR
CLASS="LITERAL"
>pam</VAR
>
    key word in the file <TT
CLASS="FILENAME"
>pg_hba.conf</TT
>. For more information about PAM, please read
    the <A
HREF="http://www.kernel.org/pub/linux/libs/pam/"
TARGET="_top"
><SPAN
CLASS="PRODUCTNAME"
>Linux-PAM</SPAN
>
    Page</A
> and the <A
HREF="http://www.sun.com/software/solaris/pam/"
TARGET="_top"
><SPAN
CLASS="SYSTEMITEM"
>Solaris</SPAN
> PAM Page</A
>.
   </P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="client-authentication.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="client-authentication-problems.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Client Authentication</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="client-authentication.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Authentication problems</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>